benchmark_result/bench_result_hadware_evol/fio/xen_4_12_0/vm1/fio_result/round6/seq_read_throughput
seq_read_throughput: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

seq_read_throughput: (groupid=0, jobs=4): err= 0: pid=18400: Fri Jun 21 09:28:38 2024
   read: IOPS=2520, BW=2525MiB/s (2647MB/s)(148GiB/60011msec)
    slat (usec): min=89, max=32876, avg=1378.17, stdev=2556.66
    clat (usec): min=712, max=375605, avg=99977.86, stdev=45690.05
     lat (msec): min=2, max=377, avg=101.39, stdev=46.13
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   31], 10.00th=[   43], 20.00th=[   60],
     | 30.00th=[   71], 40.00th=[   86], 50.00th=[  100], 60.00th=[  110],
     | 70.00th=[  122], 80.00th=[  133], 90.00th=[  157], 95.00th=[  180],
     | 99.00th=[  236], 99.50th=[  262], 99.90th=[  309], 99.95th=[  330],
     | 99.99th=[  355]
   bw (  KiB/s): min=212292, max=1792510, per=25.04%, avg=647392.08, stdev=203939.11, samples=480
   iops        : min=  207, max= 1750, avg=632.00, stdev=199.18, samples=480
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=13.12%
  lat (msec)   : 100=37.79%, 250=48.51%, 500=0.72%
  cpu          : usr=6.54%, sys=36.01%, ctx=79623, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=151248,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2525MiB/s (2647MB/s), 2525MiB/s-2525MiB/s (2647MB/s-2647MB/s), io=148GiB (159GB), run=60011-60011msec

Disk stats (read/write):
  xvda: ios=1255400/15, merge=0/11, ticks=1838920/20, in_queue=1751124, util=99.34%